Repository: rayb47/fyp-project
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pt

source: Home
pt: Lar

source: Vocabulary
pt: Vocabulário

source: Analytics
pt: Análise

source: Diacritics
pt: Diacríticos

source: Culture
pt: Cultura

source: Architecture
pt: Arquitetura

source: Festivals
pt: Festivais

source: Media
pt: Meios de comunicação

source: Portugal is a nation that takes great pride in its festivals, which vividly reflect its rich heritage and past culture.
pt: Portugal é uma nação que se orgulha muito dos seus festivais, que reflectem vividamente o seu rico património e cultura passada.

source: These nationwide festivals encompass a wide range of activities, from religious rites to secular revelries, all imbued with a distinct regional identity and a sense of community. Portuguese villages and cities come alive with celebrations all year long, featuring ornate parades, traditional music and dancing, and an abundance of regional cuisine. These celebrations unite communities and provide a sense of cultural pride and belonging while also honoring historical and religious customs. These festivities provide tourists with a rare glimpse into Portugal's essence, exhibiting a vibrant and vibrant manifestation of the country's history and the friendly hospitality of its populace.
pt: Estas festas nacionais abrangem uma vasta gama de actividades, desde ritos religiosos a folias seculares, todas imbuídas de uma identidade regional distinta e de um sentido de comunidade. As aldeias e cidades portuguesas ganham vida com celebrações durante todo o ano, com desfiles ornamentados, música e danças tradicionais e uma abundância de cozinha regional. Estas celebrações unem as comunidades e proporcionam um sentimento de orgulho cultural e de pertença, ao mesmo tempo que honram os costumes históricos e religiosos. Estas festividades proporcionam aos turistas um raro vislumbre da essência de Portugal, exibindo uma manifestação vibrante e vibrante da história do país e da hospitalidade amigável da sua população.

source: Rotate the cube on the right to view images of some common Portuguese festivals.
pt: Rode o cubo à direita para ver imagens de algumas festas portuguesas comuns.

source: Click on their names to learn more.
pt: Clique nos nomes deles para saber mais.

source: 'Rock in Rio is one of the world's largest and most famous music festivals originally founded in Rio de Janeiro, Brazil in 1985. As time passed, it has also become a prominent event in Portugal where it has been held every 2 years, since 2004. The festival is renowned for being held on a large scale, drawing top international artists across various music genres, from rock and pop, to electronic and indie.
pt: O Rock in Rio é um dos maiores e mais famosos festivais de música do mundo, fundado originalmente no Rio de Janeiro, Brasil, em 1985. Com o passar do tempo, tornou-se também um evento de destaque em Portugal, onde é realizado a cada 2 anos, desde 2004. O festival é conhecido por ser realizado em grande escala, atraindo os principais artistas internacionais de vários gêneros musicais, desde rock e pop até eletrônico e indie.

source: Location:
pt: Localização:

source: It is held in Lisbon, usually at the Parque de Bela Vista, which is a large park that can accomodate the expansive stages, audience areas and entertainment zones that are required to host the festival.
pt: Realiza-se em Lisboa, normalmente no Parque da Bela Vista, que é um grande parque que pode acomodar os amplos palcos, áreas de audiência e zonas de entretenimento necessárias para acolher o festival.

source: Dates:
pt: Datas:

source: Not fixed, but usually in the month of September.
pt: Não fixas, mas geralmente no mês de setembro.

source: Also known as 'Dia de Santo António', the Feast Day of St. Anthony is one of Portugal's most cherished festivals where St.Anthony is considered the Patron Saint of lovers and the protector of lost items. The festival combines religious observance with popular festivities that reflect the deep cultural heritage and community spirit among the people.
pt: Também conhecida como 'Dia de Santo António', a Festa de Santo António é uma das festas mais queridas de Portugal onde Santo António é considerado o padroeiro dos amantes e o protetor dos objetos perdidos. O festival combina a observância religiosa com festividades populares que refletem a profunda herança cultural e o espírito comunitário entre as pessoas.

source: One of the unique aspects of the Feast Day of Saint Anthony is the mass wedding ceremony, also known as 'Casamentos de Santa António' (Saint Anthony's Weddings). Every year, several selected couples are married simultaneously in a high-profile event that symbolizes love and community. Saint Anthony is revered as the match-maker saint, which makes these weddings particularly meaningful.
pt: Uma das particularidades da Festa de Santo António é a cerimónia de casamento em massa, também conhecida como 'Casamentos de Santo António'. Todos os anos, vários casais selecionados casam-se simultaneamente num evento de alto nível que simboliza o amor e a comunidade. Santo António é venerado como o santo casamenteiro, o que torna estes casamentos particularmente significativos.

source: June 13
pt: 13 de Junho

source: The São João festival is one of Portugal's most lively and colorful celebrations. It honors Saint John the Baptist and marks the beginning of the Summer season. It is characterized by a mix of religious and traditional festivities, which make it a significant cultural event with deep roots in Portuguese tradition.
pt: A festa de São João é uma das celebrações mais animadas e coloridas de Portugal. Homenageia São João Batista e marca o início do verão. Caracteriza-se por uma mistura de festividades religiosas e tradicionais, que o tornam um evento cultural significativo e com profundas raízes na tradição portuguesa.

source: Keeping with ancient tradition, bonfires are a central part of São João, around which people gather to celebrate, sing and jump over the flames as a symbol of protection and purification. One of the more amusing and unique traditions is the use of soft plastic hammers. Festival-goers playfully hit each other on the head with these hammers to create a friendly and joyful reaction amongst themselves.
pt: Mantendo a tradição milenar, as fogueiras são um elemento central do São João, em torno das quais as pessoas se reúnem para celebrar, cantar e saltar sobre as chamas como símbolo de proteção e purificação. Uma das tradições mais divertidas e únicas é o uso de martelos de plástico macio. Os festivaleiros batem uns nos outros na cabeça com estes martelos para criar uma reação amigável e alegre entre si.

source: Mainly celebrated in Porto, and also other parts of Northern Portugal like Braga and Vila do Conde, although on a smaller scale.
pt: Celebrado principalmente no Porto, mas também noutras zonas do Norte de Portugal como Braga e Vila do Conde, embora em menor escala.

source: The Carinval in Portugal, known locally as 'Carnaval', is a pre-Lenten festival celebrated with great enthusiasm and a variety of rich traditions. It takes place right before Ash Wednesday and features a blend of religious, pagan and modern elements.
pt: O Carinval em Portugal, conhecido localmente como 'Carnaval', é um festival pré-quaresmal celebrado com grande entusiasmo e uma variedade de ricas tradições. Acontece pouco antes da Quarta-feira de Cinzas e apresenta uma mistura de elementos religiosos, pagãos e modernos.

source: The Carnaval is widely known for its elaborate parades featuring colorful floats, vibrant costumes and the lively samba bands. The participants in these parades often dress in an extravagant manner, reflecting both traditional themes and social or political commentary.
pt: O Carnaval é amplamente conhecido por seus desfiles elaborados com carros alegóricos coloridos, fantasias vibrantes e animadas bandas de samba. Os participantes desses desfiles costumam se vestir de maneira extravagante, refletindo tanto temas tradicionais quanto comentários sociais ou políticos.

source: The festivities take place all over Portugal, but the most famous celebrations can be found in the regions of Torres Vedras, Ovar, Loulé and Madeira.
pt: As festas acontecem um pouco por todo o país, mas as celebrações mais famosas encontram-se nas regiões de Torres Vedras, Ovar, Loulé e Madeira.

source: The days leading up to Ash Wednesday (decided by the Christian Calendar)
pt: Os dias que antecedem a Quarta-feira de Cinzas (decidido pelo Calendário Cristão)

source: Semana Santa (Holy Week) is a deeply significant and solemn festival that commemorates the passion of Christ. It has been celebrated for centuries, and is deep rooted in the Roman Catholic tradition. In Portugal and many other Catholic countries across the globe, these celebrations are a spiritual experience that involves processions, rituals and ceremonies.
pt: A Semana Santa (Semana Santa) é uma festa profundamente significativa e solene que comemora a paixão de Cristo. É celebrado há séculos e está profundamente enraizado na tradição católica romana. Em Portugal e em muitos outros países católicos do mundo, estas celebrações são uma experiência espiritual que envolve procissões, rituais e cerimónias.

source: The celebration of Holy Week includes 4 parts, namely, Palm Sunday, Holy Thursday, Good Friday and Easter Sunday.
pt: A celebração da Semana Santa inclui 4 partes, nomeadamente, Domingo de Ramos, Quinta-feira Santa, Sexta-feira Santa e Domingo de Páscoa.

source: All across Portugal.
pt: Em todo Portugal.

source: It spans the last week of Lent. Starting on Palm Sunday and ending on Easter Sunday.
pt: Abrange a última semana da Quaresma. Começando no Domingo de Ramos e terminando no Domingo de Páscoa.

source: Festas Das Cruzes (Festival of Crosses) is a traditional Portuguese festival that has deep religious roots and commemorates the discovery of a crucifix by the local people, which is believed to have miraculous origins. It is not only a religious event but also a time of joyful celebration, reflecting the community's culture and Heritage
pt: As Festas Das Cruzes são uma festa tradicional portuguesa que tem profundas raízes religiosas e comemora a descoberta de um crucifixo pela população local, que se acredita ter origens milagrosas. Não é apenas um evento religioso, mas também um momento de celebração alegre, refletindo a cultura e o património da comunidade.

source: This festival is a vivid example of how Portugal preserves and celebrates its rich history and religious heritage through annual community events by blending devotion with cultural festivity.
pt: Este festival é um exemplo vívido de como Portugal preserva e celebra a sua rica história e património religioso através de eventos comunitários anuais, combinando a devoção com a festividade cultural.

source: Primarily celebrated in Barcelos, located in Northern Portugal.
pt: Comemorado principalmente em Barcelos, localizado no Norte de Portugal.

source: The beginning of Spring.
pt: Início da primavera.

source: Portugal is renowned for its rich architecural heritage, spanning across several centuries and a variety of styles, from Romanesque to Manueline, and from Baroque to Modern. Information on the six most famous architectural sites in Portugal are displayed below.
pt: Portugal é conhecido pelo seu rico património arquitetónico, abrangendo vários séculos e uma variedade de estilos, do românico ao manuelino, e do barroco ao moderno. Abaixo são apresentadas informações sobre os seis sítios arquitetónicos mais famosos de Portugal.

source: Interact with the maps and switch to Street View to get a better view of the sites.
pt: Interaja com os mapas e mude para o Street View para ter uma visão melhor dos locais.

source: Located in the heart of Lisbon, this tower is a masterpiece of the Manueline style, combining elements of Gothic and Renaissance architecture. It was built in the early 16th century as a part of the defenses at the mouth of the Lisbon Harbor. Now, it is a UNESCO World Heritage Site and one of the most photographed landmarks of Portugal.
pt: Situada no coração de Lisboa, esta torre é uma obra-prima do estilo manuelino, combinando elementos da arquitetura gótica e renascentista. Foi construído no início do século XVI como parte das defesas da foz do Porto de Lisboa. Hoje é Património Mundial da UNESCO e um dos marcos mais fotografados de Portugal.

source: Also located in Belem, Lisbon, the Jeronimos Monastery is one of the best examples of the late Gothic Architecture. It was built in the early 16th century by King Manuel I to commemorate the return of Vasco De Gama from his journey to India, and give thanks to God for the wealth it brought to Portugal. This site is also a part of the same UNESCO World Heritage designation as the Tower Of Belem.
pt: Também localizado em Belém, Lisboa, o Mosteiro dos Jerónimos é um dos melhores exemplos da arquitectura gótica tardia. Foi construído no início do século XVI por D. Manuel I para comemorar o regresso de Vasco De Gama da sua viagem à Índia e dar graças a Deus pelas riquezas que trouxe a Portugal. Este local também faz parte da mesma designação de Patrimônio Mundial da UNESCO que a Torre de Belém.

source: Situated upon a hilltop in the Sintra mountains surrounded by lush forests and gardens, this palace is one of the finest examples of 19th century romanticism in the world. Today, the palace is a UNESCO World Heritage Site and considered to be one of the Seven Wonders of Portugal.
pt: Situado no topo de uma colina na serra de Sintra, rodeado por exuberantes florestas e jardins, este palácio é um dos melhores exemplos do romantismo do século XIX no mundo. Hoje, o palácio é Património Mundial da UNESCO e considerado uma das Sete Maravilhas de Portugal.

source: Located in Batalha, this monastery is one of the most important Gothic sites in Portugal, renowned for its intricate Manueline flourishes. It was built to commemorate the Battle of Aljubarotta (1385) and took over a century to complete. It features a breathtaking array of sculptures, filigree and the famed Unfinished Chapels.
pt: Localizado na Batalha, este mosteiro é um dos locais góticos mais importantes de Portugal, conhecido pelos seus intrincados floreios manuelinos. Foi construído para comemorar a Batalha de Aljubarotta (1385) e demorou mais de um século a ser concluído. Possui uma impressionante variedade de esculturas, filigranas e as famosas Capelas Inacabadas.

source: Located in Porto, Casa de Musica is one of the most strikingly modern and innovative architectural landmarks in Portugal. It was designed by Dutch Artist Rem Koolhas in 2001, and the construction was completed in 2005. It stands out not only for its distinct contemporary design, but also for its cultural significance as a principal venue for music and performing arts.
pt: Situada no Porto, a Casa de Música é um dos marcos arquitetónicos mais modernos e inovadores de Portugal. Foi desenhado pelo artista holandês Rem Koolhas em 2001 e a construção foi concluída em 2005. Destaca-se não só pelo seu design contemporâneo distinto, mas também pelo seu significado cultural como principal espaço de música e artes performativas.

source: The Alcobaça Monastery is one of the oldest and most impressive exapmples of Cistercian architecure in Portugal. Founded in the 12th century, the monastery is celebrated for the purity and clarity of its architectural style, and is particularly noted for the ornate tombs of King Pedro I and Inês de Castro.
pt: O Mosteiro de Alcobaça é um dos exemplos mais antigos e impressionantes da arquitectura cisterciense em Portugal. Fundado no século XII, o mosteiro é celebrado pela pureza e clareza do seu estilo arquitectónico, destacando-se particularmente pelos túmulos ornamentados de D. Pedro I e D. Inês de Castro.

source: Music
pt: Música

source: Settings
pt: Configurações

source: Logout
pt: Sair

source: Portuguese music has a rich heritage that blends traditional sounds with a contemporary influence, creating a vibrant music scene that is recognized worldwide. At the heart of Portugal's music tradition is Fado, which is recognized by UNESCO as a World Intangible Cultural Heritage. It is a genre characterized by mournful tunes and lyrics, often about the sea life or the poor. Fado is usually performed in small intimate venues called 'Fado Houses' and is an essential experience for anyone visiting Portugal. A Fado performance generally comprises of a solo singer accompanied by a classical Portuguese Guitar. It is meant to carry a sense of resignation and melancholy, known as 'saudade' in Portuguese.
pt: A música portuguesa tem um património rico que combina sons tradicionais com influência contemporânea, criando um cenário musical vibrante e reconhecido mundialmente. No coração da tradição musical de Portugal está o Fado, reconhecido pela UNESCO como Património Cultural Imaterial Mundial. É um gênero caracterizado por melodias e letras tristes, muitas vezes sobre a vida marinha ou os pobres. O Fado é normalmente apresentado em pequenos espaços intimistas denominados 'Casas de Fado' e é uma experiência essencial para quem visita Portugal. Uma actuação de Fado é geralmente composta por um cantor a solo acompanhado por uma Guitarra Clássica Portuguesa. Pretende transmitir um sentimento de resignação e melancolia, conhecido como 'saudade' em português.

source: Explore the profound depths of Fado with this curated playlist.
pt: Explorar as profundezas do Fado com esta lista de reprodução selecionada.

source: Beyond Fado, Portugal is known for its folk music, which varies significantly from region to region. In the North, you find the upbeat tunes of folklore music accompanied by accordions and violas. The traditional dance styles like "Corridinho" from the region of Algarve add to the cultural flavor.
pt: Além do Fado, Portugal é conhecido pela sua música folclórica, que varia significativamente de região para região. No Norte, você encontra as melodias animadas da música folclórica acompanhadas de acordeões e violas. Os estilos de dança tradicionais como o "Corridinho" da região do Algarve contribuem para o sabor cultural.

source: Portugal has embraced modern music enthusiastically, with festivals like Rock in Rio Lisboa drawing fans of rock, pop, electronic and indie music. These events often showcase international acts alongside the country's favourite artists, providing a platform for emerging Portuguese musical talent to thrive. In the contemporary settings, genres such as hip-hop, dance and electronic have flourished with artists and DJs from Portugal gaining recognition on the European stage. Portuguese pop music, heavily influenced by Brazillian sounds due to the common language and cultural ties, is also a constant presence in the charts.
pt: Portugal abraçou a música moderna com entusiasmo, com festivais como o Rock in Rio Lisboa atraindo fãs de rock, pop, música eletrónica e indie. Estes eventos apresentam frequentemente actuações internacionais ao lado dos artistas favoritos do país, proporcionando uma plataforma para o talento musical português emergente prosperar. Nos cenários contemporâneos, géneros como o hip-hop, a dança e a electrónica floresceram com artistas e DJs de Portugal a ganharem reconhecimento no palco europeu. A música pop portuguesa, fortemente influenciada pelas sonoridades brasileiras devido à língua comum e aos laços culturais, também é presença constante nas paradas.

source: Discover the sounds of Portugal with these curated playlists of Portuguese music, featuring a mix of pop, contemporary hits, modern music, and everything in between. Click play and immerse yourself in the rhythms of Portugal.
pt: Descubra os sons de Portugal com estas playlists selecionadas de música portuguesa, apresentando uma mistura de pop, sucessos contemporâneos, música moderna e tudo mais. Clique no play e mergulhe nos ritmos de Portugal.

source: A vibrant mix of modern Portuguese pop music.
pt: Uma mistura vibrante de música pop portuguesa moderna.

source: An assortment of a variety of Portuguese music.
pt: Uma variedade de música portuguesa.
